START1 = 'Здравствуйте ,'
START2 = '!\n Я чат-бот для музеев Казанского Университета'
OSN_TEXT = 'Что вас интересует?\n\nВыберите одну из представленных ниже функций'
HISTORY_ALMA_TEXT = 'Знаете ли Вы историю alma-mater ?'
MAILING_TEXT = 'Если вы хотите подписаться или отписаться от рассылки, нажмите кнопку ниже'
HISTORY_TEXT = 'Музеи Казанского университета – ровесники вуза. ' \
               'Они возникли в начале XIX в. и использовались в учебном' \
               ' процессе и в научных исследованиях. Впоследствии они были' \
               ' открыты для осмотра широкой публикой и стали первыми публичными' \
               ' музейными собраниями Поволжского региона.\n\nКоллекции музеев – это, в ' \
               'большей степени, результат экспедиционной деятельности ученых, привозивших' \
               ' в Казань диковинные предметы со всего света. Сейчас КФУ обладает уникальным музейным' \
               ' собранием, некоторые из экспонатов не имеют аналогов в России, и представлены только в' \
               ' музеях Казанского университета. Объем этой коллекции – около 800 000 единиц хранения.\n\nБольшинство' \
               ' из музеев КФУ расположено в главном здании или во дворе университета на центральной улице Казани – Кремлевской.'
BACK_TEXT = 'Вернул вас в главное меню'
MY_MUSEUM_TEXT = 'Большинство из музеев КФУ расположено в главном здании или во дворе университета на центральной улице Казани – Кремлевской:'
PRICE_TEXT = 'Экскурсионный билет для группы до 6 человек - 900 руб.' \
             '\n\nЭкскурсионный билет для группы от 6 до 20 - 150 руб. за 1 посетителя' \
             '\n\nБилет на обзорную экскурсию по одному музею и' \
             'университетскому комплексу для группы до 6 человек - 1 620 руб.' \
             '\n\nБилет на обзорную экскурсию по одному музею и университетскому комплексу для группы от 6 до 20 человек - 270 руб. за 1 посетителя'
TIME_WORK_TEXT = 'Музеи открыты с 9.00 до 18.00 с понедельника по субботу.\n\n Для посещения необходима предварительная запись.'
SOCIAL_TEXT = 'Наши социальные сети:'
#~~~~~~~~~~~~~~~~~~
EXCURSION_DATE = 'Выберите дату'
EXCURSION_MOUNT = 'Выберите месяц'
EXCURSION_TIME = 'Выберите время'
FINAL_EXCURS = 'Вы записались на:\n'
SUCCES_ZAP = 'Вы успешно записались, теперь можете выбрать дальнейшие действия'
#~~~~~~~~~~~~~~~~~~
MUSEUMS_1 = 'Музей истории Казанского университета' \
            '\n\nИдея создания музея истории была высказана в 1946 г. в университетской газете «Ленинец» студентом Е.Г. Бушканцем (впоследствии - профессор Казанского педагогического института, доктор филологических наук). Однако прошло более тридцати лет, прежде чем эта идея осуществилась.' \
            '\n\nМузею было выделено помещение бывшей университетской церкви в главном корпусе университета.После 1917 г. она использовалась как физкультурный зал, в 1941-1943 гг. - общежитие для эвакуированных сотрудников АН СССР из Москвы и Ленинграда; позднее - читальный зал Научной библиотеки имени Н.И. Лобачевского.' \
            '\n\nНомер телефона: +7 (843) 238-15-73' \
            '\n\nАдрес: ул. Кремлевская, 18'
MUSEUMS_2 = 'Геологический музей им. А.А. Штукенберга' \
            '\n\nИстория Геологического музея ведётся с 1805 года, когда по Уставу Императорского Казанского университета при отделении физических и математических наук был создан Кабинет естественной истории или, как его называли, Натуральный Кабинет.' \
            '\n\nПервым заведующим Кабинетом был назначен профессор Карл Федорович Фукс.' \
            '\n\nНомер телефона: +7 (843) 292-08-19' \
            '\n\nАдрес: ул. Кремлевская, 4/5'
MUSEUMS_3 = 'Музей Казанской химической школы' \
            '\n\nЗдание составляет часть архитектурного ансамбля университетского двора. Строительство его было закончено в 1837 году по проекту архитектора М.П. Коринфского и предназначалось для физической (второй этаж) и химической (первый этаж) лабораторий университета' \
            '\n\nЭто была первая настоящая химическая лаборатория Казанского университета, и именно здесь началось развитие органической химии в России. Создание музея относится к 1863 году, когда А.М.Бутлеров назначил первого хранителя музея - фармацевта А.И.Ломана, прослужившего в нем более двадцати лет.' \
            '\n\nНомер телефона: +7 (960) 031-01-30' \
            '\n\nАдрес:ул. Кремлёвская, 18 корпус 5'
MUSEUMS_4 = 'Этнографический музей' \
            '\n\nС момента основания Казанского университета в нем начало формироваться собрание этнографических предметов. В 1815 г. в университете образуется Кабинет редкостей, ставший «прародителем» современного Этнографического музея университета. Именно в Кабинет редкостей была доставлена этнографическая коллекция И. М. Симонова по народам Океании и китайская коллекция О. М. Ковалевского.' \
            '\n\nНомер телефона: +7 (843) 233-71-92' \
            '\n\nАдрес: ул. Кремлевская, 18'
MUSEUMS_5 = 'Музей-лаборатория Е.К. Завойского' \
            '\n\nМузей-лаборатория Евгения Константиновича Завойского был открыт в сентябре 1997 года. Именно здесь, в комнате №246 главного здания Казанского университета, в 1944 году Евгений Константинович впервые в мире наблюдал сигналы магнитного спинового резонанса.' \
            '\n\nНомер телефона: +7 (960) 031-01-30' \
            '\n\nАдрес: ул. Кремлёвская, 18 корпус 2'
MUSEUMS_6 = 'Музей Н.И. Лобачевского' \
            '\n\nМузей Н.И. Лобачевского был создан по инициативе ректора КФУ, д.э.н. И.Р. Гафурова. Он осуществлял общее руководство.' \
            '\n\nМузей предложено было разместить в «ректорском доме». Это здание является объектом культурного наследия регионального (республиканского) наследия.' \
            '\n\nВ 2017 г. все помещения занимали подразделения Института математики и механики им. Н.И. Лобачевского.' \
            '\n\nНомер телефона: +7 (843) 233-74-82' \
            '\n\nАдрес: ул. Кремлёвская, 18 корпус 6 '
#~~~~~~~~~~~~~~~~~
INFO_KONKURS = 'Интеллектуальный конкурс «Знаете ли вы историю alma-mater?».' \
               '\n\nЕсли ты студент КФУ и обучаешься на бакалавриате или в магистратуре, то мы предлагаем тебе шанс лучше узнать свой университет. Для участия в конкурсе тебе нужно объединиться в команду из 5 человек и узнать о КФУ много нового.' \
               '\n\nГлавный приз – поездка в Санкт-Петербург, но перед этим вам предстоит пройти три конкурсных тура. В каждом этапе команды будут бороться за прохождение в следующий тур' \
               '\n\nПервый этап – онлайн-тест.' \
               '\n\nВторой этап – очное выступление команд перед жюри.' \
               '\n\nТретий этап – квест по университетскому комплексу.'
#~~~~~~~~~~~~~~~~
ON_MAILING = 'Вы успешно подписались на рассылку'
OFF_MAILING = 'Вы отписались от рассылки'
#~~~~~~~~~~~~~~~
MAILING_INFO ='Отправьте сначала фотографию, а после того, как фото пропадет, отправьте текст'
#~~~~~~~~~~~~~~~
ENTER_KEY = 'Введите секретный ключ'
ADMIN_KEY = 'OchenHochuZakrytSessiyu'
ACCES = 'Вы успешно авторизовались как администратор, теперь вы можете нажать /mailing, чтобы отправить боту картинку с описанием, и бот отправит это всем пользователям'
NOTACCES = 'Попробуйте снова'
EXIT = 'Вы нажали отмену'
#~~~~~~~~~~~~~~
QUEST1='1. 1 декабря 1792 г. родился великий геометр, создатель неевклидовой геометрии. Назовите его имя.'
QUEST2='2. В 1930-х гг. профессор Казанского университета Николай Гурьевич Четаев занимался исследованием движения потоков воздуха и их воздействия на твердые тела. Как называется эта область исследования?'
QUEST3='3. Про него говорят: «Россия потеряла поэта, но обрела великого астронома!». Единственный ученый экспедиции Ф.Ф. Беллинсгаузена и М.П. Лазарева, сделавший множество магнитных, метеорологических и астрономических наблюдений.'
QUEST4='4. Известный как основатель этнографии татарского народа, он начинал с должности профессора кафедры естественной истории и ботаники. Он читал курс натуральной истории и зоологии. Его «животная» фамилия, как нельзя кстати, подходит к преподаваемым дисциплинам. Отгадайте имя профессора.'
QUEST5='5. Александр Михайлович Бутлеров известен прежде всего как выдающийся химик. Однако в круг его интересов попадали самые разные вещи; например, степень кандидата он получил за работу о бабочках. А его последней работой, так сказать, прощальным поклоном, стало краткое руководство... По какой деятельности?'
QUEST6='6. Этот металл был обнаружен в XIX веке химиком Карлом Клаусом. Ученый назвал этот химический элемент в честь своей страны. О каком металле идет речь?'
QUEST7='7. В 1844 г. он поступил на факультет восточных языков, но через год перевелся на юридический факультет. Благодаря заданию своего преподавателя Мейера он обрел в себе силы стать одним из самых знаменитых писателей и философов в мире.'

SCORE = 'Ваш результат: '
SCORE_OST = ' из 7 возможных'